app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "last_name", "name", "phone", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Wed, 19 Feb 2014 18:30:08 UTC +00:00], ["email", nil], ["last_name", nil], ["name", nil], ["phone", nil], ["updated_at", Wed, 19 Feb 2014 18:30:08 UTC +00:00]]